# Chapter7 Data Cleaning and Prepration

In [2]:
import pandas as pd
import numpy as np

In [32]:
string_data=pd.Series(['aardvark','artichoke', np.nan,'avocado'])

In [33]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [34]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [35]:
string_data[0]=None

In [36]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [37]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [38]:
string_data.dropna()

1    artichoke
3      avocado
dtype: object

### Filtering Out Missing Data

In [39]:
from numpy import nan as NA

In [40]:
data = pd.Series([1, NA, 3.5, NA, 7])

#### dropna() on Series will drop only NA elements

In [41]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [43]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

#### dropna() on Dataframe dropna by default drops any row containing a missing value

In [44]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [45]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [51]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

#### how='all'   will only drop rows that are all NA:

In [54]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [57]:
data[4]=NA

In [58]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [60]:
data.dropna(how='all', axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0